django.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-03 日 22:33 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Django development good helper: 8 recommended plugins</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="8 Django plugins to help you build better websites faster and easier" />
<meta name="keywords" content="django, django-mptt, sorl-thumbnail, juss, restframework, django-filters" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-dark is-fixed-top'><div class='container' style='max-width:768px;padding:0 1.5rem;'><div class='navbar-brand'><a href='/' class='navbar-item'>CHANMO</a><a role='button' class='navbar-burger' aria-label='menu' aria-expanded='false' data-target='main-nav'><span aria-hidden='true'></span><span aria-hidden='true'></span><span aria-hidden='true'></span></a></div><div id='main-nav' class='navbar-menu'><div class='navbar-end'><a href='https://github.com/ChanMo' class='navbar-item' target='_blank'>Github</a><a href='./about.html' class='navbar-item'>About</a><div class='navbar-item'><input type='checkbox' class='is-hidden' id='toggle' /><label for='toggle'></label></div></div></div></div></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Django development good helper: 8 recommended plugins</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbbfad8e">1. django-allauth</a></li>
<li><a href="#org8036abb">2. django-mptt</a></li>
<li><a href="#orgfb452cf">3. django-tags</a></li>
<li><a href="#org317184f">4. sorl-thumbnail</a></li>
<li><a href="#org916a89b">5. django<sub>filters</sub></a></li>
<li><a href="#org78d0d44">6. djangorestframework</a></li>
<li><a href="#orgaf7bc87">7. django-bulma</a></li>
<li><a href="#org1104ff0">8. django-juss2</a></li>
</ul>
</div>
</nav>
<p>
Django is a powerful Python framework for developing web applications.
Plugins can provide us with additional features and functionalities in Django development,
simplifying our development work.
This article recommends some must-have Django plugins and provides a brief introduction to these plugins.
</p>

<p>
Here are some recommendations for must-have Django plugins:
</p>

<div id="outline-container-orgbbfad8e" class="outline-2">
<h2 id="orgbbfad8e"><span class="section-number-2">1.</span> django-allauth</h2>
<div class="outline-text-2" id="text-1">
<p>
django-allauth is a user authentication and authorization plugin.
It provides various authentication methods,
including username and password, email, and OAuth.
It also provides fine-grained permission control to meet complex permission requirements.
</p>

<p>
<a href="https://docs.allauth.org/en/latest/">Document</a>
</p>
</div>
</div>

<div id="outline-container-org8036abb" class="outline-2">
<h2 id="org8036abb"><span class="section-number-2">2.</span> django-mptt</h2>
<div class="outline-text-2" id="text-2">
<p>
django-mptt is a reusable Django app which aims to make it easy for you to use MPTT with your own Django models.
It takes care of the details of managing a database table as a tree structure and provides tools for working with trees of model instances.
</p>

<p>
<a href="https://django-mptt.readthedocs.io/en/latest/">Document</a>
</p>
</div>
</div>

<div id="outline-container-orgfb452cf" class="outline-2">
<h2 id="orgfb452cf"><span class="section-number-2">3.</span> django-tags</h2>
<div class="outline-text-2" id="text-3">
<p>
django-taggit is a reusable Django application designed to make adding tagging to your project easy and fun.
</p>

<p>
<a href="https://django-taggit.readthedocs.io/en/latest/">Document</a>
</p>
</div>
</div>

<div id="outline-container-org317184f" class="outline-2">
<h2 id="org317184f"><span class="section-number-2">4.</span> sorl-thumbnail</h2>
<div class="outline-text-2" id="text-4">
<p>
sorl-thumbnail is a thumbnail plugin. It can help us quickly generate thumbnails and provide flexible thumbnail configuration options.
</p>

<p>
<a href="https://sorl-thumbnail.readthedocs.io/en/latest/">Document</a>, <a href="https://github.com/jazzband/sorl-thumbnail">Github</a>
</p>
</div>
</div>

<div id="outline-container-org916a89b" class="outline-2">
<h2 id="org916a89b"><span class="section-number-2">5.</span> django<sub>filters</sub></h2>
<div class="outline-text-2" id="text-5">
<p>
Django-filter is a generic, reusable application to alleviate writing some of the more mundane bits of view code.
Specifically, it allows users to filter down a queryset based on a model’s fields,
displaying the form to let them do this.
</p>

<p>
<a href="https://django-filter.readthedocs.io/en/main/">Document</a>
</p>
</div>
</div>

<div id="outline-container-org78d0d44" class="outline-2">
<h2 id="org78d0d44"><span class="section-number-2">6.</span> djangorestframework</h2>
<div class="outline-text-2" id="text-6">
<p>
Django REST framework is a powerful and flexible toolkit for building Web APIs.
</p>

<p>
<a href="https://www.django-rest-framework.org/">Document</a>
</p>
</div>
</div>

<div id="outline-container-orgaf7bc87" class="outline-2">
<h2 id="orgaf7bc87"><span class="section-number-2">7.</span> django-bulma</h2>
<div class="outline-text-2" id="text-7">
<p>
Django Bulma is a simple and elegant Django template based on Bulma CSS framework.
It is designed to be easy to understand and use, with a modern and stylish design.
</p>

<p>
<a href="https://github.com/ChanMo/django-bulma">Github</a>
</p>
</div>
</div>

<div id="outline-container-org1104ff0" class="outline-2">
<h2 id="org1104ff0"><span class="section-number-2">8.</span> django-juss2</h2>
<div class="outline-text-2" id="text-8">
<p>
Django Juss2 is a simple, beautiful, and easy-to-use Django admin template based on the Bulma CSS framework.
It is designed to be easy to understand and use, with a modern and stylish design.
</p>

<p>
<a href="https://github.com/ChanMo/django-juss2">Github</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<script src='app.js'></script>
</div>
</body>
</html>